dotNet/interface-datatemplate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Interface types and Data Template</title>
<!-- 2016-02-18 Thu 20:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Interface types and Data Template</h1>
<p>
In a previous post I mentioned that there was an error in the
declaration and wire up of the templates, which I inadvertantly left
in the presentation. I am in the process of removing these from the
presentation and will briefly explain what the problem was and what
the solution could be. It is probably a reasonably common problem to
encounter.
</p>

<p>
I had declared my Content Control as follows:
</p>

<div class="org-src-container">

<pre class="src src-xml"><span class="linenr">1: </span>&lt;<span style="color: #268bd2;">ContentControl</span> <span style="color: #859900;">x</span>:<span style="color: #268bd2;">Name</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">SelectedDirectoryView</span><span style="color: #2aa198;">"</span>
<span class="linenr">2: </span>                <span style="color: #268bd2;">Grid.Row</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">0</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">Content</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">{Binding}</span><span style="color: #2aa198;">"</span>
<span class="linenr">3: </span>                <span style="color: #268bd2;">ContentTemplate</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">{StaticResource SelectedDirectoryViewTemplate}</span><span style="color: #2aa198;">"</span>/&gt;
</pre>
</div>

<p>
And my Data Template as follows:
</p>

<div class="org-src-container">

<pre class="src src-xml"><span class="linenr"> 4: </span>&lt;<span style="color: #268bd2;">DataTemplate</span> <span style="color: #859900;">x</span>:<span style="color: #268bd2;">Key</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">SelectedDirectoryViewTemplate</span><span style="color: #2aa198;">"</span>
<span class="linenr"> 5: </span>              <span style="color: #268bd2;">DataType</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">{x:Type vm:ISelectedDirectoryViewModel}</span><span style="color: #2aa198;">"</span> &gt;
<span class="linenr"> 6: </span>  <span style="color: #586e75; font-style: italic;">&lt;!--</span><span style="color: #586e75; font-style: italic;"> File Picker </span><span style="color: #586e75; font-style: italic;">--&gt;</span>
<span class="linenr"> 7: </span>  &lt;<span style="color: #268bd2;">Grid</span> <span style="color: #268bd2;">Grid.Row</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">0</span><span style="color: #2aa198;">"</span>  <span style="color: #268bd2;">HorizontalAlignment</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">Stretch</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">Margin</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">0,0,0,5</span><span style="color: #2aa198;">"</span>&gt;
<span class="linenr"> 8: </span>    &lt;<span style="color: #268bd2;">Grid.ColumnDefinitions</span>&gt;
<span class="linenr"> 9: </span>      &lt;<span style="color: #268bd2;">ColumnDefinition</span> /&gt;
<span class="linenr">10: </span>      &lt;<span style="color: #268bd2;">ColumnDefinition</span> <span style="color: #268bd2;">Width</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">Auto</span><span style="color: #2aa198;">"</span>/&gt;
<span class="linenr">11: </span>    &lt;/<span style="color: #268bd2;">Grid.ColumnDefinitions</span>&gt;
<span class="linenr">12: </span>    &lt;<span style="color: #268bd2;">TextBox</span> <span style="color: #268bd2;">Grid.Column</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">0</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">IsReadOnly</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">True</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">IsEnabled</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">False</span><span style="color: #2aa198;">"</span>
<span class="linenr">13: </span>             <span style="color: #268bd2;">Text</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">{Binding DirectoryPath, Mode=OneWay}</span><span style="color: #2aa198;">"</span>/&gt;
<span class="linenr">14: </span>    &lt;<span style="color: #268bd2;">Button</span> <span style="color: #268bd2;">Grid.Column</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">1</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">Margin</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">5,0,0,0</span><span style="color: #2aa198;">"</span>
<span class="linenr">15: </span>            <span style="color: #268bd2;">Command</span>=<span style="color: #2aa198;">"</span><span style="color: #2aa198;">{Binding OpenCommand}</span><span style="color: #2aa198;">"</span>&gt;
<span class="linenr">16: </span>      Select Directory
<span class="linenr">17: </span>    &lt;/<span style="color: #268bd2;">Button</span>&gt;
<span class="linenr">18: </span>  &lt;/<span style="color: #268bd2;">Grid</span>&gt;
<span class="linenr">19: </span>&lt;/<span style="color: #268bd2;">DataTemplate</span>&gt;
</pre>
</div>

<p>
While this works in my example, it should not be needed to explicitly
declare ContentTemplate on the ContentControl. So what was the problem
and what was the solution.
</p>

<p>
Removing the ContentTemplate attribute on ContentControl caused
nothing to be displayed and this was a result of 2 things:
</p>

<ol class="org-ol">
<li>The DataTemplate has an explicit key causing it not be applied
imlicitly to the ContentControl.
</li>
<li>The DataTemplate declares the DataType attribute as
ISelectedDirectoryViewModel, which is an interface type. Interface
types cannot be used as DataTypes for DataTemplates: 
</li>
</ol>

<p>
The solution was quite simple, obviously remove the key, but then make
ISelectedDirectoryViewModel an abstract class rather than an
interface, and I have a template that can be applied to any type that
derives from ISelectedDirectoryViewModel, which was what I was
intending in the code.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-18 Thu 20:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
